{
  "home.experienceField.jobDate-1": "2023 — PRESENT",
  "home.experienceField.jobDate-2": "2020 — PRESENT",
  "home.experienceField.jobDescription-1": "As a front-end developer, I specialized in creating responsive user interfaces with React, ensuring seamless navigation with React Router, and applying Styled Components for cohesive styling. I managed application state using Redux, enabling consistent UI and data synchronization. My role also involved diligent debugging and error resolution to maintain application integrity. Additionally, I prioritized clear documentation and detailed component descriptions to enhance code readability and teamwork.",
  "home.experienceField.jobDescription-2": "In my position, I focused on data preparation and processing with Oracle SQL, tailored to customer needs, and developed analytical report templates using Delphi. I configured and parameterized ERP systems, optimizing them for client operations, and managed their exploitation. Analyzing customer needs and business processes was central to providing customized solutions. Additionally, I was responsible for crafting and delivering product presentations, effectively highlighting solution benefits to clients and strengthening client relationships.",
  "home.experienceField.jobTech-1": "JavaScript,React.js,Redux,Styled Components,CSS,GIT,SCRUM",
  "home.experienceField.jobTech-2": "Oracle Databases,SQL,Python,Delphi,Data analysis,SSH,Windows Serwer,Software Implementation",
  "home.experienceField.jobTitle-1": "Junior Frontend Developer · CryptoTradingHub",
  "home.experienceField.jobTitle-2": "Mid Software Implementation Specialist · Unisoft",
  "home.aboutMe.part-1": "I am a Frontend Developer with one year of experience, specialising in <span class='highlight__about'>JavaScript</span>, <span class='highlight__about'>React.js</span>, <span class='highlight__about'>HTML</span>, and <span class='highlight__about'>CSS</span>. My skill set includes effective management of application state using <span class='highlight__about'>Redux</span>. I excel in designing responsive user interfaces, emphasising both aesthetics and efficiency.",
  "home.aboutMe.part-2": "I possess proficiency in <span class='highlight__about'>SQL</span> and have hands-on experience with <span class='highlight__about'>Databases</span>, equipping me to manage data efficiently. As a results-driven programmer, I am ready for continuous growth and eager to embrace new challenges in <span class='highlight__about'>Frontend development</span>.",
  "home.aboutMe.part-3": "Outside of my computer work, I'm deeply passionate about <span class='highlight__about'>Brazilian Jiu-Jitsu</span>. This martial art perfectly blends artistic skill with the thrill of strategic combat.",
  "home.jobTitleDescription": "I build pixel-perfect, engaging, and accessible digital experiences.",
  "home.jobTitle": "Junior Frontend Developer",
  "home.nameAndSurname": "Bartosz Kulpa",
  "menu.about": "ABOUT",
  "menu.courses": "COURSES",
  "menu.experience": "EXPERIENCE",
  "menu.projects": "PROJECTS",
  "navigation.contact": "Contact",
  "navigation.experience": "Experience",
  "navigation.home": "Home",
  "navigation.projects": "Projects",
  "navigation.skills": "Skills"
}
