{
  "home.aboutMe.part-1": "I am a Frontend Developer with one year of experience, specialising in <span class='highlight__about'>JavaScript</span>, <span class='highlight__about'>React.js</span>, <span class='highlight__about'>HTML</span>, and <span class='highlight__about'>CSS</span>. My skill set includes effective management of application state using <span class='highlight__about'>Redux</span>. I excel in designing responsive user interfaces, emphasising both aesthetics and efficiency.",
  "home.aboutMe.part-2": "I possess proficiency in <span class='highlight__about'>SQL</span> and have hands-on experience with <span class='highlight__about'>Databases</span>, equipping me to manage data efficiently. As a results-driven programmer, I am ready for continuous growth and eager to embrace new challenges in <span class='highlight__about'>Frontend development</span>.",
  "home.aboutMe.part-3": "Outside of my computer work, I'm deeply passionate about <span class='highlight__about'>Brazilian Jiu-Jitsu</span>. This martial art perfectly blends artistic skill with the thrill of strategic combat.",
  "home.educationField.educationDate-1": "09.2023 — PRESENT",
  "home.educationField.educationDate-2": "03.2022 — 10.2022",
  "home.educationField.educationDate-3": "02.2021 — 08.2021",
  "home.educationField.educationDate-4": "10.2014 — 02.2018",
  "home.educationField.educationDescription-1": "Completed an extensive 40+ hour course focusing on advanced React development, covering React Basics, React Router, Redux with Redux Saga for state management, and asynchronous Redux. Gained proficiency in React Hooks, the Context API, React Suspense + Lazy for performance optimization, and integrating Firebase and Stripe API for backend and payment solutions. Developed skills in Styled-Components for styling, GraphQL with Apollo for data management, and built Progressive Web Apps (PWAs). Enhanced application performance and adopted React Design Patterns. Mastered testing with Jest and Snapshot testing, learned React Best Practices, including Persistence + Session Storage, and State Normalization.",
  "home.educationField.educationDescription-2": "Completed a 445-hour part-time Frontend Developer course at infoShare Academy, featuring 240 hours of interactive workshops. The program delivered in-depth knowledge and practical expertise in foundational and advanced frontend technologies. Mastered JavaScript and the React library for dynamic web application development, TypeScript for adding strong typing to JavaScript, and Firebase for backend services. Gained proficiency in HTML/CSS for building and styling web pages, and learned to use GIT for version control and collaboration in software projects. This comprehensive training equipped me with the skills to design and develop modern, responsive web applications.",
  "home.educationField.educationDescription-3": "Completed a rigorous 445-hour part-time online bootcamp, including 240 hours of hands-on workshops, focused on acquiring both theoretical knowledge and practical skills in key areas of data science and software development. The curriculum encompassed SQL for database management, Python programming for versatile coding tasks, and advanced topics in artificial intelligence including Machine Learning and Deep Learning techniques. Additionally, the course covered version control using GIT, essential for collaborative coding projects and professional software development workflows. This comprehensive training equipped me with the necessary tools to tackle complex data analysis and machine learning challenges.",
  "home.educationField.educationDescription-4": "Graduated from the University of Szczecin with a degree in Information Technology and Econometrics. Acquired skills in programming (JavaScript, HTML/CSS, Python, C#), IT system development and analysis, database management (SQL), and Big Data analytics. The program also covered mathematical analysis and statistics, equipping me with the tools for accurate data forecasting. This education blends technical IT expertise with analytical econometrics skills, preparing me for complex challenges in both fields.",
  "home.educationField.educationTech-1": "React.js,Redux,Redux Saga,Asynchronous Redux,Context API,TypeScript,Firebase,Testing with Jest",
  "home.educationField.educationTech-2": "JavaScript,React.js,React DOM,TypeScript,Firebase,HTML,CSS,GIT,SCRUM",
  "home.educationField.educationTech-3": "Python,PostgreSQL,Databases,Machine Learning,Deep Learning,GIT,SCRUM",
  "home.educationField.educationTech-4": "JavaScript,HTML,CSS,Python,C#,Development and analysis of IT systems,Databases,MsSQL,Big Data,Mathematical Analysis,Statistics and Data Forecast",
  "home.educationField.educationTitle-1": "Complete React Developer · Udemy",
  "home.educationField.educationTitle-2": "Frontend Developer · infoShare Academy",
  "home.educationField.educationTitle-3": "Data Science · infoShare Academy",
  "home.educationField.educationTitle-4": "Information Technology and Econometrics · University of Szczecin",
  "home.experienceField.jobDate-1": "01.2023 — PRESENT",
  "home.experienceField.jobDate-2": "03.2020 — PRESENT",
  "home.experienceField.jobDate-3": "09.2019 — 03.2020",
  "home.experienceField.jobDescription-1": "As a front-end developer, I specialized in creating responsive user interfaces with React, ensuring seamless navigation with React Router, and applying Styled Components for cohesive styling. I managed application state using Redux, enabling consistent UI and data synchronization. My role also involved diligent debugging and error resolution to maintain application integrity. Additionally, I prioritized clear documentation and detailed component descriptions to enhance code readability and teamwork.",
  "home.experienceField.jobDescription-2": "In my position, I focused on data preparation and processing with Oracle SQL, tailored to customer needs, and developed analytical report templates using Delphi. I configured and parameterized ERP systems, optimizing them for client operations, and managed their operation. Analyzing customer needs and business processes was central to providing customized solutions. Additionally, I was responsible for crafting and delivering product presentations, effectively highlighting solution benefits to clients and strengthening client relationships.",
  "home.experienceField.jobDescription-3": "I resolved technical issues with the portal, managed SSH operations for secure network administration, and configured software to enhance functionality. Running the helpdesk independently, I provided prompt user support. Additionally, I moderated the website to meet SEO standards and verified the accuracy of changes and content. I also served as the IT representative, aligning technical operations with company goals.",
  "home.experienceField.jobTech-1": "JavaScript,React.js,Redux,Styled Components,CSS,GIT,SCRUM",
  "home.experienceField.jobTech-2": "Oracle Databases,Oracle SQL,Python,Delphi,Data analysis,SSH,Windows/Linux Server,Software Implementation",
  "home.experienceField.jobTech-3": "CSS,HTML,SSH,MySQL,SEO,IT consulting,Technical support",
  "home.experienceField.jobTitle-1": "Junior Frontend Developer · CryptoTradingHub",
  "home.experienceField.jobTitle-2": "Mid Software Implementation Specialist · Unisoft",
  "home.experienceField.jobTitle-3": "Junior IT Administrator · DobryAdres.pl",
  "home.experienceField.resume": "View Full Resume",
  "home.projectField.projectAltText-1": "Screenshoot of the homepage in CRWN Clothing Shop",
  "home.projectField.projectAltText-2": "Screenshoot of the Monster Rolodex Project",
  "home.projectField.projectAltText-3": "Screenshoot of the Fusely Landing Page Project",
  "home.projectField.projectAltText-4": "Screenshoot of the Cahee Template Project",
  "home.projectField.projectDescription-1": "Developed the \"CRWN Clothing Shop\" project in the Complete React Developer course on Udemy. Project involved using React, React Router and Redux for state management. The page features user account creation functionality, enabled through integration with Firebase, allowing for user registration and authentication processes.",
  "home.projectField.projectDescription-2": "The 'Monster Rolodex' project in a React.js learning pathway. This application leverages React for UI rendering, incorporating asynchronous API calls to an internal database for fetching monster data. It features a dynamic search functionality, allowing users to filter monsters by names through a dedicated input field. The project demonstrates key React concepts such as component structuring, state management, and the handling of asynchronous operations.",
  "home.projectField.projectDescription-3": "Fusely Landing Page is a modern, responsive website designed to provide an engaging user experience for a subscription-based business. This project consists of an HTML file and a corresponding CSS stylesheet, creating a visually appealing and user-friendly interface.",
  "home.projectField.projectDescription-4": "Cahee Template is an elegantly designed, responsive website showcasing a fresh, colorful design, it blends aesthetic appeal with functional design, using HTML and CSS. This project is suitable for businesses emphasizing freshness, health, or lifestyle themes.",
  "home.projectField.projectTitle-1": "CRWN Clothing Shop · Project in progress",
  "home.projectField.projectTitle-2": "Monster Rolodex",
  "home.projectField.projectTitle-3": "Fusely Landing Page",
  "home.projectField.projectTitle-4": "Cahee Template",
  "home.jobTitleDescription": "I build pixel-perfect, engaging, and accessible digital experiences.",
  "home.jobTitle": "Frontend Developer",
  "home.nameAndSurname": "Bartosz Kulpa",
  "menu.about": "ABOUT",
  "menu.education": "EDUCATION",
  "menu.experience": "EXPERIENCE",
  "menu.projects": "PROJECTS",
  "page.title": "Bartosz Kulpa",
  "page.title.404": "This page could not be found"
}
