{
  "home.aboutMe.part-1": "Jestem programistą Frontend z rocznym doświadczeniem, specjalizuję się w <span class='highlight__about'>JavaScript</span>, <span class='highlight__about'>React.js</span>, <span class='highlight__about'>HTML</span> i <span class='highlight__about'>CSS</span>. Moje umiejętności obejmują skuteczne zarządzanie stanem aplikacji za pomocą <span class='highlight__about'>Redux</span>. Wyróżniam się w projektowaniu responsywnych interfejsów użytkownika, zwracając uwagę zarówno na estetykę, jak i efektywność.",
  "home.aboutMe.part-2": "Posiadam zaawansowaną wiedzę w zakresie <span class='highlight__about'>SQL</span> i doświadczenie w pracy z <span class='highlight__about'>bazami danych</span>, co umożliwia mi efektywne zarządzanie danymi. Jako programista nastawiony na rezultaty, jestem gotowy na ciągły rozwój i chętnie podejmuję nowe wyzwania w obszarze <span class='highlight__about'>rozwoju frontendu</span>.",
  "home.aboutMe.part-3": "Poza pracą przy komputerze, pasjonuję się <span class='highlight__about'>Brazylijskim Ju-Jitsu</span>. Ta sztuka walki idealnie łączy umiejętności artystyczne z emocjonującą strategią walki.",
  "home.educationField.educationDate-1": "09.2023 — OBECNIE",
  "home.educationField.educationDate-2": "03.2022 — 10.2022",
  "home.educationField.educationDate-3": "02.2021 — 08.2021",
  "home.educationField.educationDate-4": "10.2014 — 02.2018",
  "home.educationField.educationDescription-1": "Ukończyłem rozbudowany 40-godzinny kurs zaawansowanego programowania w React, obejmujący podstawy Reacta, React Router, zarządzanie stanem za pomocą Reduxa i Redux Saga, oraz asynchroniczny Redux. Nauczyłem się React Hooks, Context API, React Suspense + Lazy do optymalizacji wydajności, integracji z Firebase i Stripe API dla rozwiązań backendowych i płatności. Rozwinąłem umiejętności w tworzeniu komponentów za pomocą Styled-Components, zarządzania danymi z GraphQL i Apollo oraz budowy Progressive Web Apps (PWA) i optymalizacji wydajność aplikacji, przyjąłem wzorce projektowe Reacta. Opanowałem testy za pomocą Jest i Snapshotów, poznałem najlepsze rozwiązania React, w tym przechowywanie sesji oraz normalizację stanu.",
  "home.educationField.educationDescription-2": "Ukończyłem 445-godzinny kurs Frontend Developer w infoShare Academy, który obejmował 240 godzin interaktywnych warsztatów. Program kursu zapewnił mi dogłębną wiedzę i praktyczne umiejętności z zakresu podstawowych i zaawansowanych technologii frontendowych. Opanowałem JavaScript i bibliotekę React do tworzenia progresywnych aplikacji webowych, TypeScript do typowanego JavaScript, oraz Firebase do usług backendowych. Opanowałem HTML/CSS do tworzenia i stylowania stron internetowych, nauczyłem się korzystać z GIT do kontroli wersji i współpracy w projektach programistycznych. To kompleksowe szkolenie pozwoliło mi opanować umiejętności projektowania i tworzenia nowoczesnych, responsywnych aplikacji internetowych.",
  "home.educationField.educationDescription-3": "Ukończyłem intensywny 445-godzinny kurs online, w tym 240 godzin praktycznych warsztatów, skupiających się na zdobywaniu zarówno teoretycznej wiedzy, jak i praktycznych umiejętności w kluczowych obszarach Data Science i rozwoju oprogramowania. Program szkoleniowy obejmował naukę SQL do zarządzania bazami danych, programowanie w języku Python i zaawansowane zagadnienia w zakresie  sztucznej inteligencji, w tym techniki Machine Learning i Deep Learning. Kurs obejmował także kontrolę wersji przy użyciu GIT, niezbędną do współpracy w projektach programistycznych. To kompleksowe szkolenie pomogło mi opanowaniu wiedzy niezbędnej w pracy jako Data Sciencist i przy analizie danych.",
  "home.educationField.educationDescription-4": "Ukończyłem studia na kierunku Informatyka i Ekonometria na Uniwersytecie Szczecińskim. Nabyłem umiejętności w programowaniu (JavaScript, HTML/CSS, Python, C#), rozwijaniu i analizowaniu systemów IT, zarządzaniu bazami danych (SQL) oraz analizie Big Data. Program objął również analizę matematyczną i statystykę, wyposażając mnie w narzędzia do dokładnego prognozowania danych. To wykształcenie połączyło techniczną wiedzę IT z analitycznymi umiejętnościami ekonometrycznymi, przygotowując mnie do skomplikowanych wyzwań w obu dziedzinach.",
  "home.educationField.educationTech-1": "React.js,Redux,Redux Saga,Asynchroniczny Redux,Context API,TypeScript,Firebase,Testy z użyciem Jest",
  "home.educationField.educationTech-2": "JavaScript,React.js,React DOM,TypeScript,Firebase,HTML,CSS,GIT,SCRUM",
  "home.educationField.educationTech-3": "Python,PostgreSQL,Databases,Machine Learning,Deep Learning,Tableau,GIT,SCRUM",
  "home.educationField.educationTech-4": "JavaScript,HTML,CSS,Python,C#,Analiza i projektowanie systemów IT,Bazy danych,MsSQL,Big Data,Analiza matematyczna,Statystyka i prognozowanie danych",
  "home.educationField.educationTitle-1": "Complete React Developer · Udemy",
  "home.educationField.educationTitle-2": "Frontend Developer · infoShare Academy",
  "home.educationField.educationTitle-3": "Data Science · infoShare Academy",
  "home.educationField.educationTitle-4": "Informatyka i Ekonometria · Uniwersytet Szczeciński",
  "home.experienceField.jobDate-1": "01.2023 — OBECNIE",
  "home.experienceField.jobDate-2": "03.2020 — OBECNIE",
  "home.experienceField.jobDate-3": "09.2019 — 03.2020",
  "home.experienceField.jobDescription-1": "Jako frontend developer specjalizuję się w tworzeniu responsywnych interfejsów użytkownika z użyciem Reacta, zapewniając płynną nawigację z React Router i stosując Styled Components do stylowania komponentów. Zarządzam stanem aplikacji za pomocą Reduxa, co umożliwia spójny interfejs użytkownika i synchronizację danych. Moje stanowisko obejmuje również debugowanie i rozwiązywanie błędów w celu utrzymania integralności aplikacji. Ponadto, przywiązuję dużą wagę do klarownej dokumentacji i szczegółowych opisów komponentów, aby ułatwić czytelność kodu i współpracę w zespole.",
  "home.experienceField.jobDescription-2": "Na zajmowanym stanowisku skupiałem się na przygotowywaniu i przetwarzaniu danych przy użyciu Oracle SQL, dostosowanych do potrzeb klientów. Opracowywałem szablony raportów analitycznych wykorzystując Delphi. Konfigurowałem i parametryzowałem systemy ERP, optymalizując je pod kątem operacji klientów, oraz zarządzałem funkcjonowaniem systemów. Analiza potrzeb klientów i procesów biznesowych była kluczowa do dostarczania spersonalizowanych rozwiązań. Ponadto, byłem odpowiedzialny za tworzenie i dostarczanie prezentacji produktów, podkreślając korzyści rozwiązań i wzmacniając relacje z klientami.",
  "home.experienceField.jobDescription-3": "Zajmowałem się rozwiązywaniem problemów technicznych z portalem, zarządzaniem operacjami SSH dla bezpiecznej administracji sieci oraz konfiguracją oprogramowania w celu zwiększenia jego funkcjonalności. Niezależnie prowadziłem helpdesk, zapewniając szybkie wsparcie użytkownikom. Ponadto, moderowałem stronę internetową, aby spełniała standardy SEO i weryfikowałem dokładność wprowadzanych zmian i treści. Pełniłem również funkcję reprezentanta IT, dostosowując operacje techniczne do celów firmy.",
  "home.experienceField.jobTech-1": "JavaScript, React.js, Redux, Styled Components, CSS, GIT, SCRUM",
  "home.experienceField.jobTech-2": "Bazy danych Oracle, Oracle SQL, Python, Delphi, Analiza danych, SSH, Serwery Windows/Linux, Implementacja oprogramowania",
  "home.experienceField.jobTech-3": "CSS, HTML, SSH, MySQL, SEO, Doradztwo IT, Wsparcie techniczne",
  "home.experienceField.jobTitle-1": "Junior Frontend Developer · CryptoTradingHub",
  "home.experienceField.jobTitle-2": "Specjalista ds. Wdrożeń · Unisoft",
  "home.experienceField.jobTitle-3": "Młodszy Administrator IT · DobryAdres.pl",
  "home.experienceField.resume": "Zobacz Całe CV",
  "home.projectField.projectAltText-1": "Zrzut ekranu strony głównej sklepu CRWN Clothing",
  "home.projectField.projectAltText-2": "Zrzut ekranu projektu Monster Rolodex",
  "home.projectField.projectAltText-3": "Zrzut ekranu projektu Fusely Landing Page",
  "home.projectField.projectAltText-4": "Zrzut ekranu projektu Cahee Template",
  "home.projectField.projectDescription-1": "Stworzenie projektu \"Sklep CRWN Clothing\" w ramach kursu Complete React Developer na Udemy. Projekt wykorzystywał React, React Router i Redux do zarządzania stanem. Strona oferuje funkcjonalność tworzenia konta użytkownika, umożliwioną przez integrację z Firebase, co pozwala na proces rejestracji i uwierzytelniania użytkowników.",
  "home.projectField.projectDescription-2": "Projekt 'Monster Rolodex' w ramach nauki React.js. Ta aplikacja wykorzystuje React do renderowania interfejsu użytkownika, włączając asynchroniczne wywołania API do zewnętrznej bazy danych w celu pobierania danych o potworach. Oferuje dynamiczną funkcjonalność wyszukiwania, pozwalającą użytkownikom filtrować potwory po nazwach za pomocą dedykowanego pola. Projekt zawiera kluczowe koncepcje Reacta, takie jak strukturyzacja komponentów, zarządzanie stanem i obsługa operacji asynchronicznych.",
  "home.projectField.projectDescription-3": "Fusely Landing Page to nowoczesna, responsywna strona internetowa zaprojektowana, aby odzworować interfejs aplikacji opratej o subskrypcje. Ten projekt składa się z pliku HTML i odpowiadającego mu arkusza stylów CSS, tworząc wizualnie atrakcyjny i przyjazny dla użytkownika interfejs.",
  "home.projectField.projectDescription-4": "Szablon Cahee to elegancko zaprojektowana, responsywna strona internetowa prezentująca nowoczesny, kolorowy design, łączący atrakcyjność wizualną z funkcjonalnym projektem, wykorzystując HTML i CSS. Ten projekt jest odpowiedni dla firm działających w zdrowia lub zdrowego styl życia.",
  "home.projectField.projectTitle-1": "Sklep CRWN Clothing · W trakcie realizacji",
  "home.projectField.projectTitle-2": "Monster Rolodex",
  "home.projectField.projectTitle-3": "Strona Startowa Fusely",
  "home.projectField.projectTitle-4": "Szablon Cahee",
  "home.jobTitleDescription": "Tworzę perfekcyjne, nowoczesne i zaawansowane cyfrowe doświadczenia.",
  "home.jobTitle": "Frontend Developer",
  "home.nameAndSurname": "Bartosz Kulpa",
  "language-switcher.description": "SWITCH TO ENGLISH",
  "menu.about": "O MNIE",
  "menu.education": "EDUKACJA",
  "menu.experience": "DOŚWIADCZENIE",
  "menu.projects": "PROJEKTY",
  "page.title": "Bartosz Kulpa",
  "page.title.404": "Nie znaleziono strony"
}
